// مرتب‌سازی ادغامی (Insertion Sort)
// مرتب‌سازی ادغامی یک روش مرتب‌سازی آرایه از طریق تقسیم آرایه به بخش‌های مرتب و نامرتب است.
// سپس آیتم نامرتب مقایسه می‌شود تا موجه شویم آیا از آیتم قبلی خود بزرگ‌تر است یا نه و اگر نبود آیتم جدید را درج می‌کنیم.
// در واقع ما به دنبال آیتم‌های مرتب از سمت چپ به راست می‌گردیم و آن‌ها را به ترتیب در آرایه مرتب درج می‌کنیم.

// (Insertion Sort)

function insertionSort(arr) {
    const len = arr.length;

    for (let i = 0; i < len; i++) {
        let key = arr[i];
        let j = i - 1;

        while (j >= 0 && arr[j] > key) {
            arr[j + 1] = arr[j];
            j--;
        }

        arr[j + 1] = key;
    }

    return arr;
}

console.log(insertionSort([20, 5, 15, 35, 10]));
//output: [ 5, 10, 15, 20, 35 ]